ruby/Hackathon/app/controllers/api/v1/logs_controller.rb

      def index
        # Fetch all actions and include their associated urls and issues
        actions = Action.includes(urls: :issues).all
        # Create the desired structure for the response
        result = actions.group_by(&:domain).map do |domain, actions_in_domain|
          {
            "domain" => domain,
            "logs" => actions_in_domain.flat_map do |action|
              action.urls.map do |url|
                {
                  "action_type" => action.flow,  # action.flow will give you 'check_out' or 'listing'
                  "url" => url.link,  # Assuming 'link' is the field containing the URL
                  "console_errors" => url.issues&.where(error_type: 'console').first&.issue,
                  "network_errors" => url.issues&.where(error_type: 'network').first&.issue,
                  "explanation" => action.explanation
---
SELECT "actions".* FROM "actions"
SELECT "urls".* FROM "urls" WHERE "urls"."action_uid" IN ($1, $2, $3, $4, $5, $6)
SELECT "issues".* FROM "issues" WHERE "issues"."url_uid" = $1 AND "issues"."error_type" = $2 ORDER BY "issues"."id" ASC LIMIT $3  [["url_uid", "bee88591-f381-415c-b148-2c305b1e9a1d"], ["error_type", 1], ["LIMIT", 1]]

      def create_action_item(hash)
        action = Action.create(flow: hash["action_type"], domain: param["domain"], explanation: param["explanation"] )
---
INSERT INTO "actions" ("flow", "domain", "explanation", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

      def create_url_item(hash, action_uid)
        url = Url.create(action_uid: action_uid, link: hash["url"])
---
INSERT INTO "urls" ("action_uid", "link", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

      def create_issue_item(hash, action_uid, url_uid)
        Issue.create(action_uid: action_uid, url_uid: url_uid, error_type: "console", issue: hash.to_h["console_errors"] )
        Issue.create(action_uid: action_uid, url_uid: url_uid, error_type: "network", issue: hash.to_h["network_errors"] )
---
INSERT INTO "issues" ("url_uid", "action_uid", "issue", "error_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"